// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//     1. перебрати його циклом while
//     2. перебрати його циклом for
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

let arr1 =[2,17,13,6,22,31,45,66,100,-18];

// 1. перебрати його циклом while
let i=0;
while (i<arr1.length)
{
    console.log(arr1[i]);
    i++;
}

// 2. перебрати його циклом for

for (let i= 0; i<arr1.length; i++){
    console.log(arr1[i]);
}

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом

let i=0;
while (i<arr1.length)
{
    if (i %2 !== 0){console.log(arr1[i]);}
    i++;
}

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

for (let i= 0; i<arr1.length; i++){
    if (i%2!==0){console.log(arr1[i]);}
}

// 5. перебрати циклом while та вивести  числа тільки парні  значення

let i=0;
while (i<arr1.length)
{
    if (arr1[i] %2 === 0){console.log(arr1[i]);}
    i++;
}

// 6. перебрати циклом for та вивести  числа тільки парні  значення

for (let i= 0; i<arr1.length; i++){
    if (arr1[i] % 2 === 0){console.log(arr1[i]);}
}

// 7. замінити кожне число кратне 3 на слово "okten"

for (let i = 0; i < arr1.length; i++) {
    if(arr1[i]%3===0){
        arr1[i]="okten";
    }
    console.log(arr1[i]);
}
// 8. вивести масив в зворотньому порядку.

for (let i = 9; i >= 0; i--) {
console.log(arr1[i]);
}

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

// 1. перебрати його циклом while

let i=arr1.length-1;
while (i>=0)
{
    console.log(arr1[i]);
    i--;
}

// 2. перебрати його циклом for

for (let i= arr1.length-1; i>=0; i--){
    console.log(arr1[i]);
}

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом

let i=arr1.length-1;
while (i>=0)
{
    if (i %2 !== 0){console.log(arr1[i]);}
    i--;
}

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

for (let i = arr1.length-1; i>0; i--){
    if (i%2!==0){console.log(arr1[i]);}
}

// 5. перебрати циклом while та вивести  числа тільки парні  значення

let i=arr1.length-1;
while (i>=0)
{
    if (arr1[i] %2 === 0){console.log(arr1[i]);}
    i--;
}

// 6. перебрати циклом for та вивести  числа тільки парні  значення

for (let i= arr1.length; i>=0; i--){
    if (arr1[i] % 2 === 0){console.log(arr1[i]);}
}

// 7. замінити кожне число кратне 3 на слово "okten"

for (let i = arr1.length-1; i >=0; i--) {
    if(arr1[i]%3===0){
        arr1[i]="okten";
    }
    console.log(arr1[i])
}






