// - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)
// - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)
// - створити функцію яка повертає найбільше число з масиву
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
// - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.
// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше (Math використовувати заборонено);
// - створити функцію яка заповнює масив рандомними числами
// (цей код генерує рандомні числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.
// - створити функцію яка заповнює масив рандомними числами в діапазоні від 0 до limit. limit - аргумент, який характеризує кінцеве значення діапазону.
// - Функція приймає масив та робить з нього новий масив в зворотньому порядку. [1,2,3] -> [3, 2, 1].

// - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)
function min(a,b,c){
    if(a<b && a<c){
        document.write(`Найменше число це ${a}`)
    }
    else if(c<b && c<a){
        document.write(`Найменше число це ${c}`)
    }
    else if(b<a && b<c){
        document.write(`Найменше число це ${b}`)
    }
    else{
        document.write('Помилка введення!')
    }
}

// - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)

function max(a,b,c){
    if(a>b && a>c){
        document.write(`Найбільше число це ${a}`)
    }
    else if(c>b && c>a){
        document.write(`Найбільше число це ${c}`)
    }
    else if(b>a && b>c){
        document.write(`Найбільше число це ${b}`)
    }
    else{
        document.write('Помилка введення!')
    }
}
// - створити функцію яка повертає найбільше число з масиву
function arrayMax(array) {
        let max = array[0];
        for (const element of array) {
            if(element > max){
                max = element;
            }
        }
        return max;
    }
// - створити функцію яка повертає найменьше число з масиву
function arrayMin(array) {
    let min = array[0];
    for (const element of array) {
        if(element < min){
            min = element;
        }
    }
    return min;
}
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
function sum(a,b,c){
    let arr = [a,b,c]
    return a+b+c;
}

// - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.

function seredne(a,b,c){
    let arr=[a,b,c];
    return (a+b+c)/arr.length
}
// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше (Math використовувати заборонено);
function maxminArray(array){
    let min = array[0];
    let max = array[0];
    for (const arrayElement of array) {
        if (arrayElement>max){
            max= arrayElement;
        }
        if (arrayElement<min){
            min = arrayElement;
        }
    }
    console.log(max);
    return min;
   }

// - створити функцію яка заповнює масив рандомними числами
// (цей код генерує рандомні числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.
function randomizer(arr){
    for (let i = 0; i < 10; i++) {
        arr[i] = Math.round(Math.random()*100);

    }
    return arr;
}

// - створити функцію яка заповнює масив рандомними числами в діапазоні від 0 до limit. limit - аргумент, який характеризує кінцеве значення діапазону.
function randomizerlimit(arr,limit){
    for (let i = 0; i < 10; i++) {
        arr[i] = Math.round(Math.random()*limit);

    }
    return arr;
}

   // - Функція приймає масив та робить з нього новий масив в зворотньому порядку. [1,2,3] -> [3, 2, 1].
function reverseArr(a,b,c){
    let arr= [a,b,c];
    return [c, b, a];

}






